Catalogs/LM_Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>LM_Тарифы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/LM_ЦеныТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>LM_ЦеныТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаЗанятие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/LM_Тарифы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ЦеныТарифов.Параметры.УстановитьЗначениеПараметра("Тариф",Объект.Ссылка);
	
	Если Объект.Наименование = "" Тогда
		Объект.Наименование = "Тариф " +Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ЦеныТарифов.Параметры.УстановитьЗначениеПараметра("Тариф",Объект.Ссылка);
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЦену(Команда) 	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			Сообщить("Не заполнено наименование тарифа!");
			Возврат;
		КонецЕсли;		
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Тариф еще не записан! Записать?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Записать();
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Тариф", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.LM_ЦеныТарифов.Форма.ФормаЗаписиТолькоЧтение",ПараметрыФормы,,,ВариантОткрытияОкна.ОтдельноеОкно);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

Процедура ОбновитьВидимость()
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	LM_ЦеныТарифовСрезПоследних.Период КАК Период,
		|	LM_ЦеныТарифовСрезПоследних.КоличествоЧасов КАК КоличествоЧасов,
		|	LM_ЦеныТарифовСрезПоследних.КоличествоУроков КАК КоличествоУроков,
		|	LM_ЦеныТарифовСрезПоследних.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.LM_ЦеныТарифов.СрезПоследних(&ТекДата, ) КАК LM_ЦеныТарифовСрезПоследних
		|ГДЕ
		|	LM_ЦеныТарифовСрезПоследних.Тариф = &Тариф
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		Запрос.УстановитьПараметр("Тариф", Объект.Ссылка);
		Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
		Цены = Запрос.Выполнить().Выгрузить();
		
		Если Цены.Количество() > 0 Тогда
			Если Цены[0].КоличествоЧасов > 0 Тогда
				Элементы.Декорация1.Заголовок = "" +Формат(Цены[0].Сумма/Цены[0].КоличествоЧасов,"ЧДЦ=2")+ " за 1 час ("
				+Формат(Цены[0].Сумма,"ЧДЦ=2")+ " / " +Цены[0].КоличествоЧасов+ " ч.)";				
			ИначеЕсли Цены[0].КоличествоУроков > 0 Тогда
				Элементы.Декорация1.Заголовок = "" +Формат(Цены[0].Сумма/Цены[0].КоличествоУроков,"ЧДЦ=2")+ " за 1 урок ("
				+Формат(Цены[0].Сумма,"ЧДЦ=2")+ " / " +Цены[0].КоличествоУроков+ " ур.)";
			КонецЕсли;
			Элементы.Декорация2.Заголовок = "Действующая цена на " +Формат(Цены[0].Период,"ДЛФ=D")+ ": ";
		Иначе
			Элементы.Декорация2.Заголовок = "";
			Элементы.Декорация1.Заголовок = "Нет действующих цен! Создайте новую цену!";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
